IDEA Connection Link
ConnectionLink.WriteConCheckResults Method
 Writes check results in xml format into outStream If results do not exist CBFEM analysis is executed
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public bool WriteConCheckResults(
	Stream outStream
)
Public Function WriteConCheckResults (
	outStream As Stream
) As Boolean
public:
bool WriteConCheckResults(
	Stream^ outStream
)
Parameters
outStream
Type: System.IO.Stream
Output stream
Return Value
Type: Boolean
True if success
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace